app/views/posts/index.html.erb

         <%=link_to post_path(post), method: :post do%>
          <p>申込</p><%=post.likes.count%>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`post_id` = 9