app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    post.user_id = current_user.id

    if post.save
---
INSERT INTO `posts` (`body`, `user_id`, `title`, `start_time`, `end_time`, `created_at`, `updated_at`) VALUES ('2試合', 1, '広島大学', '2020-10-03 10:00:00', '2020-10-03 17:00:00', '2020-10-01 05:29:20.018663', '2020-10-01 05:29:20.018663')

  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
UPDATE `posts` SET `posts`.`start_time` = '2020-09-26 10:00:00', `posts`.`updated_at` = '2020-09-23 06:34:49.212648' WHERE `posts`.`id` = 3

  def destroy
    Post.find(params[:id]).destroy
---
DELETE FROM `posts` WHERE `posts`.`id` = 2
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1